; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 140934 1 1 3 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	thermograph1 - mode
	image2 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Star5 thermograph1)
	(have_image Star6 thermograph1)
	(have_image Planet7 image2)
	(have_image Star8 image0)
	(have_image Planet9 image0)
	(have_image Phenomenon10 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star1)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
5. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 1 of 6
6. (turn_to satellite0 star6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star6)
   goals met: 1 of 6
7. (take_image satellite0 star6 instrument0 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 2 of 6
8. (turn_to satellite0 star5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
9. (take_image satellite0 star5 instrument0 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 3 of 6
10. (turn_to satellite0 planet9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet9)
   goals met: 3 of 6
11. (take_image satellite0 planet9 instrument0 image0)
   added: (have_image planet9 image0)
   goals met: 4 of 6
12. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 6
13. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 5 of 6
14. (turn_to satellite0 planet7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet7)
   goals met: 5 of 6
15. (take_image satellite0 planet7 instrument0 image2)
   added: (have_image planet7 image2)
   goals met: 6 of 6
